export const questions = [
  {
    type: "book",
    page: 1,
    text: "מהו שמו של הארמון ובאיזה עמק הוא נמצא?",
  },
  {
    type: "book",
    page: 1,
    text: "מה שם החבורה של פו",
  },
  {
    type: "car",
    text: "ישנה אישה זהב, יש לה מקום שבו מכינים קינוחים מתוקים וקרים מאוד. מהו מספר הטלפון שלה?",
  },
  {
    type: "book",
    page: 2,
    text: "מהו כח הצ׳י?",
  },
  {
    type: "book",
    page: 7,
    text: "מי הוא הפנדה המיסתורי שאכל לפו את האוכל?",
  },
  {
    type: "car",
    text: "בין ההר לבין הכחול הגדול היא לא מפסיקה לדהור, איזו חיה גרה מול ביתה?",
  },
  {
    type: "book",
    page: 11,
    text: "מי תקף את עמק השלווה?",
  },
  {
    type: "book",
    page: 14,
    text: "לאיזה כבר הלכו פו ואבא שלו?",
  },
  {
    type: "car",
    text: "המון אנשים נכנסים לבית של הירוקים, כמה כניסות יש?",
  },
];

export const answers = [
  [
    { text: "ארמון גולי הנמצא בעמק האלה" },
    { text: "ארמון הג׳ייד הנמצא בעמק השלווה", correct: true },
    { text: "ארמון השלווה הנמצא בעמק הג׳ייד" },
  ],
  [
    { text: "חיות הפרא" },
    { text: "ארבעת הנינג׳ות" },
    { text: "חמשת הזועמים המסטרים", correct: true },
  ],
  [
    { text: "0528661994" },
    { text: "0478945612" },
    { text: "046126444", correct: true },
  ],
  [
    { text: "האנרגיה שזורמת אצל כל היצורים החיים", correct: true },
    { text: "אומנות הכנת התה" },
    { text: "יכולת לתת אגרוף זעם" },
  ],
  [
    { text: "אחותו טינה" },
    { text: "זה היה אבא שלו, קוראים לו ״לי״", correct: true },
    { text: "זה היה קאי הרשע" },
  ],
  [{ text: "ג׳ירפה" }, { text: "תוכי" }, { text: "גמל", correct: true }],
  [
    { text: "קאי" },
    { text: "הזומבים של קאי", correct: true },
    { text: "אבא של פו" },
  ],
  [
    { text: "כפר המכבים" },
    { text: "כפר הלוחמים" },
    { text: "כפר הפנדות", correct: true },
  ],
  [{ text: "11", correct: true }, { text: "3" }, { text: "25" }],
];
