export const questions = [
    {
        type: "book",
        text: "מהו שמו של הארמון ובאיזה עמק הוא נמצא?"
    },
    {
        type: "car",
        text: "ישנה אישה זהב, יש לה מקום שבו מכינים קינוחים מתוקים וקרים מאוד. מהו מספר הטלפון שלה?"
    },
];

export const answers = [
  [
    { text: "ארמון גולי הנמצא בעמק האלה" },
    { text: "ארמון הג׳ייד הנמצא בעמק השלווה", correct: true },
    { text: "ארמון השלווה הנמצא בעמק הג׳ייד" },
  ],
  [
    { text: "0528661994" },
    { text: "0478945612" },
    { text: "046126444", correct: true },
  ],
];