export const questions = [
  {
    type: "book",
    page: 6,
    text: "מי מגיעה לביקור?",
  },
  {
    type: "book",
    page: 6,
    text: "מה חשבו הילדים שיש ברכב הגדול",
  },
  {
    type: "car",
    text: "ישנה אישה זהב, יש לה מקום שבו מכינים קינוחים מתוקים וקרים מאוד. מהו מספר הטלפון שלה?",
  },
  {
    type: "book",
    page: 18,
    text: "מי לא יודע להגשים משאלות?",
  },
  {
    type: "book",
    page: 24,
    text: "מי מכין עוגות מגעילות?",
  },
  {
    type: "car",
    text: "בין ההר לבין הכחול הגדול היא לא מפסיקה לדהור, איזו חיה גרה מול ביתה?",
  },
  {
    type: "book",
    page: 43,
    text: "מה לילי ואדם הלכו להכין?",
  },
  {
    type: "book",
    page: 106,
    text: "לאן תיכנן דן לשלוח את כראמל?",
  },
  {
    type: "car",
    text: "המון אנשים נכנסים לבית של הירוקים, כמה כניסות יש?",
  },
];

export const answers = [
  [
    { text: "אבא ואמא של דן" },
    { text: "לילי הנסיכה" },
    { text: "דודה אמילי", correct: true },
  ],
  [
    { text: "סוכריות ג׳לי ושוקולד" },
    { text: "חד קרן או אלפקות, נבחרת כדורגל או שודדי ים", correct: true },
    { text: "אמא ואבא עם חתול" },
  ],
  [
    { text: "0528661994" },
    { text: "0478945612" },
    { text: "046126444", correct: true },
  ],
  [
    { text: "דג הזהב של הבית" },
    { text: "כראמל" },
    { text: "הילדים" },
    { text: "כל התשובות נכונות", correct: true },
  ],
  [
    { text: "אחותו של דן" },
    { text: "אבא מקס", correct: true },
    { text: "כראמל" },
  ],
  [{ text: "ג׳ירפה" }, { text: "תוכי" }, { text: "גמל", correct: true }],
  [
    { text: "מיץ לימונדה קר" },
    { text: "ארגז חול לכראמל", correct: true },
    { text: "סולם, להוריד את כראמל מהעץ" },
  ],
  [
    { text: "לחצר של השכנים" },
    { text: "ליער" },
    { text: "אנטרטיקה", correct: true },
  ],
  [{ text: "11", correct: true }, { text: "3" }, { text: "25" }],
];
